//
//  main.c
//  FXHuman
//
//  Created by Basil Nikityuk on 5/17/15.
//  Copyright (c) 2015 __MyCompanyName__. All rights reserved.
//

#include <stdio.h>

#include "FXTestsMacro.h"
#include "FXHumanTests.h"

int main (int argc, const char *argv[]) {
	// insert code here...
	printf("Make Human\n");
	
	performTest(FXHumanBehaviourTests);
	
	return 0;
}

/*
 Задачи:
 1. Создать объектную структуру данных человек, имеющую поля имя, возраст, пол, количество детей, женат или нет, указатель на партнера, на родителей и на массив с детьми, где могло бы быть, максимум, 20 детей.
 Требования:
 - каждая из сущностей, будь то строка или массив, должны быть обернуты в свой объект, который, как минимум, умел бы выполнять подсчет ссылок и имел базовые аксессоры и тесты;
 - реализовать подсчет ссылок, геттеры и сеттеры для полей;
 - реализовать метод жениться, который бы устанавливал поле женат в true и указатель на партнера, с которым был брак;
 - реализовать метод развестись, который бы устанавливал поле женат и указатель на партнера;
 - реализовать метод произвести потомство, который бы создавал ребенка, устанавливал ему родителей, а у родителей добавлял бы ребенка;
 - создать тесты на все поведение человека.
 */
