//
//  main.m
//  FXUsers
//
//  Created by Basil Nikityuk on 10/31/15.
//  Copyright (c) 2015 __MyCompanyName__. All rights reserved.
//

#import <UIKit/UIKit.h>

#import "FXAppDelegate.h"

int main(int argc, char *argv[]) {
    @autoreleasepool {
        return UIApplicationMain(argc, argv, nil, NSStringFromClass([FXAppDelegate class]));
    }
}

/*
 Задание 5.
 1. Создать базовый контекст, который бы имел метод execute (выполнить), cancel (отменить);
 2. Создать контекст логина в фейсбук;
 3. Создать контекст загрузки в котором из фейсбука выкачиваются все друзья юзера (имя, фамилия, превьюшка фото пользователя) и по ним создать массив моделей для ячеек;
 4. Проводить загрузку картинок в каждой из ячеек асинхронно по требованию ячейки;
 5. Модель пользователей должна быть сериализована в плист аналогично заданию 3, пункт 1;
 6. Если нет инета, то должны использоваться закешированные данные;
 7. Если есть интернет, то закешированные данные должны выкачиваться из интернета, а прошлый кеш должен быть уничтожен и заменен на новый кеш;
 8. Создать loginViewController с кнопкой loginToFacebook, по которой бы происходил логин в фейсбук;
 9. Создать friendsViewCOntroller, показывающий таблицу друзей;
 10. Создать friendDetailViewController, показывающий все инфу о друге (имя, город, страна и большая фота);
 11. Для каждого из действий создать контексты, в частности для логина в фейсбук, вытягивания друзей, вытягивания детальной инфомрации о друге, причем необходимо, чтобы хранения для описания друга и детального описания использавалась одна и та же модель друга, в которую бы контексты инкрементально добавляли данные;
 12. Добавить навигационный контроллер, для навигации между этими тремя контроллерами;
 13. Общее поведение у контроллеров должно быть вынесено в абстрактного родителя.
 */
